Reading Data From Different Source

StringIO : is a module in Python that allows you to treat strings as file-like objects. It provides an in-memory stream for text I/O (input/output), which means you can read from and write to a string just like you would with a file, but without disk I/O. To use StringIO, you need to import it from the io module:

In [14]:
import pandas as pd
from io import StringIO

Data='{"Employee_name":"Avnish","email":"vermaavnesh4@gmail.com","Job_Profile":{"title":"Team Lead","title2":"Sr.Developer"}}'
## This  Data in from of Json (Key Value Pair)

df=pd.read_json(StringIO(Data))

,Employee_name,email,Job_Profile
0,Avnish,vermaavnesh4@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr.Developer'}"

In [23]:
df.to_json()

'{"Employee_name":{"0":"Avnish"},"email":{"0":"vermaavnesh4@gmail.com"},"Job_Profile":{"0":{"title1":"Team Lead","title2":"Sr.Developer"}}}'

In [24]:
df.to_json(orient='index')

'{"0":{"Employee_name":"Avnish","email":"vermaavnesh4@gmail.com","Job_Profile":{"title1":"Team Lead","title2":"Sr.Developer"}}}'

In [25]:
df.to_json(orient='records')

'[{"Employee_name":"Avnish","email":"vermaavnesh4@gmail.com","Job_Profile":{"title1":"Team Lead","title2":"Sr.Developer"}}]'

In [26]:

df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data",header=None)

In [27]:
df.head(5)

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [28]:
pip install lxml

Requirement already satisfied: lxml in d:\data science\python\venv\lib\site-packages (6.0.0)
Note: you may need to restart the kernel to use updated packages.

In [29]:
pip install html

Note: you may need to restart the kernel to use updated packages.

  error: subprocess-exited-with-error

  × python setup.py egg_info did not run successfully.
  │ exit code: 1
  ╰─> [6 lines of output]
      Traceback (most recent call last):
        File "<string>", line 2, in <module>
        File "<pip-setuptools-caller>", line 35, in <module>
        File "C:\Users\verma\AppData\Local\Temp\pip-install-zzvrk7aj\html_9995e77579f747d0bad27fc75892cc7a\setup.py", line 12, in <module>
          long_description = __doc__.decode('utf8'),
      AttributeError: 'str' object has no attribute 'decode'. Did you mean: 'encode'?
      [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.
error: metadata-generation-failed

× Encountered error while generating package metadata.
╰─> See above for output.

note: This is an issue with the package mentioned above, not pip.
hint: See above for details.

Collecting html
  Using cached html-1.16.tar.gz (7.6 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'error'

In [30]:
df.to_csv('wine.csv')

In [31]:
## read the data html file
# pd.read_html(str(soup)) reads tables from the parsed content

url="https://www.fdic.gov/bank-failures/failed-bank-list"

df=pd.read_html(url)

In [32]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538

In [33]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
pd.read_html(url,match="Country",header=0)[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [34]:
pip install openpyxl

Requirement already satisfied: openpyxl in d:\data science\python\venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in d:\data science\python\venv\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [35]:
df_excel=pd.read_excel('data.xlsx')

In [37]:
df_excel.to_pickle('df_excel')

In [38]:
pd.read_pickle('df_excel')

         Nme  Age
0      Rohan   20
1        Ram   34
2    Harshit    5
3     Pandas   43
4     Pandit    6
5  RamKrishn    5
6   Ramgopal   43
7      Ankur   24